#include <Arduino.h>

#include "moveCar.h"  //轮胎运动库
#include "servoCar.h" //舵机库

Move move;   //轮胎运动实例
Servo servo; //舵机实例

//****************************************可调参数****************************************

//***************************************************************************************

//****************************************全局变量****************************************
// GND Pins
const uint8_t gnd_pins[8] = {12, 13, 32, 33, 34, 35, 36, 37};

//***************************************************************************************

//****************************************自定函数****************************************
//设置接口低电平作为额外地
void SetGNDPins(void);

//***************************************************************************************

void setup()
{
    SetGNDPins();

    move.Stop();
    servo.BeginTransmit();

    while (1)
    {
    }
}

void loop()
{
}

//设置接口低电平作为额外地
void SetGNDPins(void)
{
    uint8_t pin_num = sizeof(gnd_pins) / sizeof(uint8_t);

    for (uint8_t i = 0; i < pin_num; i++)
    {
        pinMode(gnd_pins[i], OUTPUT);
        digitalWrite(gnd_pins[i], LOW);
    }
}
